# todo: Определить в коде переменные:
# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
# Вывести их типы.

# Integer type variable
integer_variable = 10

# Float type variable
float_variable = 3.14

# Boolean type variable
boolean_variable = True

# String type variable
string_variable = "Hello, world!"

# None type variable (empty type)
none_variable = None

# Print the types of the variables
print(type(integer_variable))  # Output: <class 'int'>
print(type(float_variable))  # Output: <class 'float'>
print(type(boolean_variable)) # Output: <class 'bool'>
print(type(string_variable)) # Output: <class 'str'>
print(type(none_variable))  # Output: <class 'NoneType'>